# Author: Ely Kozinets(314666561)

# Exercise 1

In [100]:
number = int(input("Enter a regular number: "))

Enter a regular number: 17

In [94]:
type(number)

int

In [105]:
#Converts a given decimal number to binary, octal and hexa forms
def decimal_converter(number):
    result_binary = ""
    result_octal = ""
    result_hexa = ""
    num1 = number
    num2 = number
    num3 = number
    original_number = number
    while(num1 != 0):
        remainder = num1 % 2;
        result_binary = str(remainder) + result_binary
        num1 = int(num1 / 2)

    while(num2 != 0):
        remainder = num2 % 8;
        result_octal = str(remainder) + result_octal
        num2 = int(num2 / 8)
        
    switch = {
                10: "A",
                11: "B",
                12: "C",
                13: "D",
                14: "E",
                15: "F"
            }
    
    while(num3 != 0):
        remainder = num3 % 16
        if(remainder >= 10 and remainder < 16):
            result_hexa = switch.get(remainder) + result_hexa
        else:
            result_hexa = str(remainder) + result_hexa
        num3 = int(num3/16)
        
    return (str(original_number) + " decimal" + " in: \n"+
            "Binary: " + result_binary + "\n"+ 
            "Octal: " + result_octal + "\n"+ 
            "Hexa: " +  result_hexa)

In [104]:
print(decimal_converter(number))

17 decimal in:
Binary: 10001
Octal: 21
Hexa: 11

# Exercise 2

In [110]:
import pandas as pd
data = pd.read_csv("cast.csv")
data.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [122]:
#1. How many movies have the title "Hamlet"?

len(data[data.title == "Hamlet"])

299

In [125]:
#2. List all of the "Treasure Island" movies from earliest to most recent.

data[data.title == "Treasure Island"].sort_values(by = "year")

,title,year,name,type,character,n
1312766,Treasure Island,1918,Herschel Mayall,actor,Prologue Player,NaN
3280557,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3046750,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1167783,Treasure Island,1918,Raymond Lee,actor,Bit Role,NaN
1195421,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
...,...,...,...,...,...,...
1663860,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1731182,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1813707,Treasure Island,1999,Richard Schave,actor,Man,21.0
2710458,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
815338,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

In [168]:
#3. How many roles were credited in the silent 1921 version of Hamlet?

new_small_data1 = data[(data.title == "Hamlet") & (data.year == 1921)]
new_small_data1["character"].nunique()

9

In [190]:
#4. Use groupby() to plot the number of "Hamlet" films made each decade

data.groupby(['title', 'year'])

                                         n
title                         year
#1 Serial Killer              2013   325.0
#5                            2013     0.0
#50Fathers                    2015     0.0
#73, Shaanthi Nivaasa         2007    78.0
#AnonOccupy: Bio of a Villain 2015     0.0
...                                    ...
w Delta z                     2007   223.0
whiteonwhite:algorithmicnoir  2011     0.0
www.XXX.com                   2003     3.0
xXx                           2002  1905.0
xXx: State of the Union       2005   864.0

[174675 rows x 1 columns]